# Pandas

In [1]:
import numpy as np
import pandas as pd

# Creating Series
There are serveral ways ti creating a Series:
* list
* Dictionary
* Numpy Array

# Creating a Series frompython list

In [2]:
data = [1,2,3,4,5,6]
type(data)

list

In [3]:
# creating a Series from list
sr = pd.Series(data)
# type of df
type(sr)

pandas.core.series.Series

In [4]:
sr

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

# Creating a Series from python dictionary

In [5]:
data_dic ={
    "name": "radhe",
    "address": "thimi",
    "age": 12
}

In [6]:
df = pd.Series(data_dic)

In [7]:
df

name       radhe
address    thimi
age           12
dtype: object

In [8]:
type(df)

pandas.core.series.Series

# Creating a Series from numpy array

In [9]:
arra = np.array(data)
type(arra)

numpy.ndarray

In [10]:
sr = pd.Series(arra)
print(df)

name       radhe
address    thimi
age           12
dtype: object

In [11]:
type(sr)

pandas.core.series.Series

In [12]:
df.shape

(3,)

# Creating DataFram
Serveral ways to create Pandas DataFrame are:
* Create DataFrame from 2D list
* Create DataFrame from Dictionary of lists
* Create DataFrame from list of dictionary
* Create DataFrame from csv file
* Create DataFrame from excel file

# Create DataFrame from 2D list

In [13]:
data = [[1,2],[3,4,],[5,6,]]
print(len(data))

3

In [14]:
df = pd.DataFrame(data, columns=['col1','col2'])

In [15]:
df

   col1  col2
0     1     2
1     3     4
2     5     6

# Create DataFrame from Dictionary of lists

In [16]:
data ={
    "name": ["ram", "hari","sita"],
    "address": ["ktm","ktm","bkt"]
}

In [17]:
df_dic = pd.DataFrame(data)
df_dic

   name address
0   ram     ktm
1  hari     ktm
2  sita     bkt

In [18]:
df_dic.rename({"name":"f_name"}, axis="columns")

  f_name address
0    ram     ktm
1   hari     ktm
2   sita     bkt

# Create DataFrame from list of dictionary

In [19]:
data = [
    {
        "name": "ram",
        "age": 12
        
    },
    {
        "address": "bkt",
        "gender": 'Male'
    }
]

In [20]:
type(data)

list

In [21]:
for i in data:
    print(type(i))

<class 'dict'>
<class 'dict'>

In [22]:
df = pd.DataFrame(data)
df

  name   age address gender
0  ram  12.0     NaN    NaN
1  NaN   NaN     bkt   Male

# Data Ingestion:
* Data ingestion is the process of obtaining and inport data for immediate use of storage in a database.
* This repository includes variaty of Dataset, so for now we will use that as data source.

# Create DataFrame from csv file

In [23]:
df = pd.read_csv("car_details.csv")

In [24]:
df

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner
...,...,...,...,...,...,...,...,...
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual,Second Owner
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual,Second Owner
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner

In [43]:
df.to_excel("my_dataset.xlsx", index=False)

ModuleNotFoundError: No module named 'openpyxl'

In [26]:
import openpyxl

ModuleNotFoundError: No module named 'openpyxl'

# Viewing Data

In [27]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [28]:
df.describe()

              year  selling_price      km_driven
count  4340.000000   4.340000e+03    4340.000000
mean   2013.090783   5.041273e+05   66215.777419
std       4.215344   5.785487e+05   46644.102194
min    1992.000000   2.000000e+04       1.000000
25%    2011.000000   2.087498e+05   35000.000000
50%    2014.000000   3.500000e+05   60000.000000
75%    2016.000000   6.000000e+05   90000.000000
max    2020.000000   8.900000e+06  806599.000000

In [29]:
df.describe(include='object')

                          name    fuel seller_type transmission        owner
count                     4340    4340        4340         4340         4340
unique                    1491       5           3            2            5
top     Maruti Swift Dzire VDI  Diesel  Individual       Manual  First Owner
freq                        69    2153        3244         3892         2832

In [30]:
df.isna()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
4335,False,False,False,False,False,False,False,False
4336,False,False,False,False,False,False,False,False
4337,False,False,False,False,False,False,False,False
4338,False,False,False,False,False,False,False,False
4339,False,False,False,False,False,False,False,False

In [31]:
df.isna().sum()

name             0
year             0
selling_price    0
km_driven        0
fuel             0
seller_type      0
transmission     0
owner            0
dtype: int64

In [32]:
df['selling_price']

0        60000
1       135000
2       600000
3       250000
4       450000
         ...
4335    409999
4336    409999
4337    110000
4338    865000
4339    225000
Name: selling_price, Length: 4340, dtype: int64

In [33]:
df['name'].unique

<bound method Series.unique of 0                             Maruti 800 AC
1                  Maruti Wagon R LXI Minor
2                      Hyundai Verna 1.6 SX
3                    Datsun RediGO T Option
4                     Honda Amaze VX i-DTEC
                       ...
4335    Hyundai i20 Magna 1.4 CRDi (Diesel)
4336             Hyundai i20 Magna 1.4 CRDi
4337                    Maruti 800 AC BSIII
4338       Hyundai Creta 1.6 CRDi SX Option
4339                       Renault KWID RXT
Name: name, Length: 4340, dtype: object>

In [38]:
df.loc[df['name']== "Maruti 800 AC BSIII"]["selling_price"].mean()

89000.0

In [39]:
df.loc[(df['name']== "Maruti 800 AC BSIII") & (df['year']==2007)]

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
1398,Maruti 800 AC BSIII,2007,75000,90000,Petrol,Individual,Manual,Second Owner
3632,Maruti 800 AC BSIII,2007,60000,52000,Petrol,Individual,Manual,First Owner

In [41]:
df.loc[(df['name']== "Maruti 800 AC BSIII") & (df['year']==2007)].selling_price.mean()

67500.0